# CLI Calculator

**언어 선택 | 言語を選択**

<details open>
<summary><strong>🇰🇷 한국어</strong></summary>

Rust로 작성된 간단한 명령줄 계산기입니다. 다양한 수학 연산과 계산 히스토리 기능을 제공합니다.

## ✨ 주요 기능

- **기본 연산**: 덧셈(`+`), 뺄셈(`-`), 곱셈(`*`), 나눗셈(`/`)
- **고급 연산**: 모듈로(`%`), 제곱(`^`), 제곱근(`sqrt()`)
- **연산자 우선순위**: 수학적 우선순위에 따라 자동 계산
- **괄호 지원**: 복잡한 표현식 계산 가능
- **음수 지원**: 음수 숫자 및 단항 연산자 지원
- **계산 히스토리**: 최근 50개의 계산 기록 저장 및 조회
- **마지막 결과 재사용**: `ans` 키워드로 이전 결과 사용
- **부동소수점 정밀도 처리**: 깔끔한 결과 표시

## 🚀 설치 및 실행

### 요구사항

- Rust 1.70 이상
- Cargo (Rust 패키지 매니저)

### 빌드 및 실행

```bash
# 저장소 클론
git clone <repository-url>
cd cli_calcul

# 빌드
cargo build --release

# 실행
cargo run

# 또는 릴리즈 빌드 실행
./target/release/cli_calcul
```

## 📖 사용 방법

### 기본 사용

프로그램을 실행하면 프롬프트(`>`)가 나타납니다. 수학 표현식을 입력하면 결과가 표시됩니다.

```
> 2 + 3 * 4
Result: 14

> (2 + 3) * 4
Result: 20

> sqrt(16) + 2^3
Result: 12

> 10 % 3
Result: 1
```

### 명령어

- `history` 또는 `h` - 계산 히스토리 보기
- `clear` 또는 `c` - 히스토리 지우기
- `help` 또는 `?` - 도움말 보기
- `exit` 또는 `quit` - 프로그램 종료

### 마지막 결과 사용 (`ans`)

`ans` 키워드를 사용하여 이전 계산 결과를 표현식에 사용할 수 있습니다.

```
> 10 + 5
Result: 15

> ans * 2
Result: 30

> ans + 10
Result: 40
```

### 계산 히스토리

```
> 2 + 3
Result: 5

> 5 * 4
Result: 20

> history
--- Calculation History ---
1: 2 + 3 = 5
2: 5 * 4 = 20
---------------------------
```

## 💡 사용 예시

### 기본 연산

```
> 10 + 20 - 5
Result: 25

> 2 * 3 + 4 * 5
Result: 26

> 10 / 3
Result: 3.3333333333
```

### 고급 연산

```
> 2^3
Result: 8

> 2^3^2
Result: 512

> sqrt(16)
Result: 4

> sqrt(2 + 2)
Result: 2

> 10 % 3
Result: 1
```

### 괄호 사용

```
> (2 + 3) * 4
Result: 20

> ((2 + 3) * 4) + 5
Result: 25

> 2 * (3 + 4)
Result: 14
```

### 음수 사용

```
> -5 + 3
Result: -2

> -5 * 2
Result: -10

> -(-5)
Result: 5

> (-2 + 3) * 4
Result: 4
```

### 복잡한 표현식

```
> sqrt(16) + 2^3 * 2
Result: 20

> (10 - 5) / (2 + 3)
Result: 1

> ans * 10
Result: 10
```

## 🏗️ 프로젝트 구조

```
src/
├── main.rs          # CLI 인터페이스 및 히스토리 관리
└── calc/            # 계산 엔진 모듈
    ├── mod.rs       # 모듈 선언 및 공개 API
    ├── token.rs     # 토큰화 (문자열 → 토큰)
    ├── parser.rs    # 파싱 및 평가 (토큰 → 결과)
    ├── format.rs    # 결과 포맷팅
    └── calcul.rs    # 메인 계산 인터페이스
```

### 모듈 설명

- **`token.rs`**: 표현식을 토큰(숫자, 연산자 등)으로 분리
- **`parser.rs`**: 재귀 하강 파서를 사용하여 토큰을 파싱하고 평가
- **`format.rs`**: 부동소수점 정밀도 처리 및 결과 포맷팅
- **`calcul.rs`**: 공개 API (`evl_ex` 함수)

## 🔧 기술 스택

- **언어**: Rust
- **의존성**:
  - `regex` (현재는 사용하지 않지만 Cargo.toml에 포함됨)

## 📝 연산자 우선순위

1. **제곱** (`^`) - 우측 결합, 가장 높은 우선순위
2. **곱셈, 나눗셈, 모듈로** (`*`, `/`, `%`) - 왼쪽에서 오른쪽으로
3. **덧셈, 뺄셈** (`+`, `-`) - 왼쪽에서 오른쪽으로

## 🐛 알려진 제한사항

- 현재는 단일 표현식만 계산 가능 (변수 할당 불가)
- 함수는 `sqrt()`만 지원
- 복소수 미지원

---

**즐거운 계산 되세요! 🧮**

</details>

<details>
<summary><strong>🇯🇵 日本語</strong></summary>

Rustで書かれたシンプルなコマンドライン電卓です。様々な数学演算と計算履歴機能を提供します。

## ✨ 主な機能

- **基本演算**: 加算(`+`)、減算(`-`)、乗算(`*`)、除算(`/`)
- **高度な演算**: 剰余(`%`)、累乗(`^`)、平方根(`sqrt()`)
- **演算子の優先順位**: 数学的な優先順位に従い自動計算
- **括弧対応**: 複雑な式の計算が可能
- **負の数対応**: 負の数および単項演算子に対応
- **計算履歴**: 直近50件の計算記録の保存と参照
- **直前の結果の再利用**: `ans` キーワードで前回の結果を使用
- **浮動小数点の精度処理**: 見やすい結果表示

## 🚀 インストールと実行

### 必要環境

- Rust 1.70 以上
- Cargo (Rust パッケージマネージャ)

### ビルドと実行

```bash
# リポジトリのクローン
git clone <repository-url>
cd cli_calcul

# ビルド
cargo build --release

# 実行
cargo run

# またはリリースビルドを実行
./target/release/cli_calcul
```

## 📖 使い方

### 基本的な使用

プログラムを実行するとプロンプト(`>`)が表示されます。数式を入力すると結果が表示されます。

```
> 2 + 3 * 4
Result: 14

> (2 + 3) * 4
Result: 20

> sqrt(16) + 2^3
Result: 12

> 10 % 3
Result: 1
```

### コマンド

- `history` または `h` - 計算履歴を表示
- `clear` または `c` - 履歴をクリア
- `help` または `?` - ヘルプを表示
- `exit` または `quit` - プログラムを終了

### 直前の結果の使用 (`ans`)

`ans` キーワードで前回の計算結果を式の中で使えます。

```
> 10 + 5
Result: 15

> ans * 2
Result: 30

> ans + 10
Result: 40
```

### 計算履歴

```
> 2 + 3
Result: 5

> 5 * 4
Result: 20

> history
--- Calculation History ---
1: 2 + 3 = 5
2: 5 * 4 = 20
---------------------------
```

## 💡 使用例

### 基本演算

```
> 10 + 20 - 5
Result: 25

> 2 * 3 + 4 * 5
Result: 26

> 10 / 3
Result: 3.3333333333
```

### 高度な演算

```
> 2^3
Result: 8

> 2^3^2
Result: 512

> sqrt(16)
Result: 4

> sqrt(2 + 2)
Result: 2

> 10 % 3
Result: 1
```

### 括弧の使用

```
> (2 + 3) * 4
Result: 20

> ((2 + 3) * 4) + 5
Result: 25

> 2 * (3 + 4)
Result: 14
```

### 負の数の使用

```
> -5 + 3
Result: -2

> -5 * 2
Result: -10

> -(-5)
Result: 5

> (-2 + 3) * 4
Result: 4
```

### 複雑な式

```
> sqrt(16) + 2^3 * 2
Result: 20

> (10 - 5) / (2 + 3)
Result: 1

> ans * 10
Result: 10
```

## 🏗️ プロジェクト構造

```
src/
├── main.rs          # CLI インターフェースと履歴管理
└── calc/            # 計算エンジンモジュール
    ├── mod.rs       # モジュール宣言と公開 API
    ├── token.rs     # トークン化 (文字列 → トークン)
    ├── parser.rs    # 構文解析と評価 (トークン → 結果)
    ├── format.rs    # 結果のフォーマット
    └── calcul.rs    # メイン計算インターフェース
```

### モジュールの説明

- **`token.rs`**: 式をトークン（数値、演算子など）に分割
- **`parser.rs`**: 再帰下降パーサーでトークンを解析・評価
- **`format.rs`**: 浮動小数点の精度処理と結果のフォーマット
- **`calcul.rs`**: 公開 API (`evl_ex` 関数)

## 🔧 技術スタック

- **言語**: Rust
- **依存関係**:
  - `regex` (現在は未使用だが Cargo.toml に含まれる)

## 📝 演算子の優先順位

1. **累乗** (`^`) - 右結合、最優先
2. **乗算・除算・剰余** (`*`, `/`, `%`) - 左から右へ
3. **加算・減算** (`+`, `-`) - 左から右へ

## 🐛 既知の制限

- 現在は単一の式のみ計算可能（変数代入不可）
- 関数は `sqrt()` のみ対応
- 複素数には非対応

---

**楽しい計算を！ 🧮**

</details>
